{
  "_name_or_path": "SPM-350M-Chat",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "model_type": "llama",
  "bos_token_id": 2,
  "eos_token_id": 3,
  "pad_token_id": 0,
  "hidden_size": 1024,
  "intermediate_size": 2816,
  "num_hidden_layers": 24,
  "num_attention_heads": 16,
  "num_key_value_heads": 8,
  "max_position_embeddings": 2048,
  "vocab_size": 32000,
  "rms_norm_eps": 1e-05,
  "rope_theta": 10000.0,
  "hidden_act": "silu",
  "attention_bias": false,
  "torch_dtype": "bfloat16",
  "spm_version": "chat-v1"
}